2: The zip package contains of seven .csv files. Download the package, extract the files and carry out the following:

a) Create SQL database company_database.db where each csv file appears as a table. Use SQLite

b) Query project id, employee id and hours worked from employee_projects and employee id's and salaries from 
employees_realistic. Join them on employee id.

c) Calculate the salary costs per project, assuming that the employers salary is annual and number of working hours is 1900 per year. 

d) Join this with the budget in projects table

e) Calculate how large fraction of the project budget the salary costs are.


You can use VS code SQL or Python SQLite in the task 2 b - e. 
Example of the output of the query in 2e

In [4]:
import pandas as pd
import sqlite3

In [5]:
#a) Create SQL database company_database.db where each csv file appears as a table. Use SQLite
#Read each csv to pandas dataframe
df_customers = pd.read_csv("company data/customers.csv")
df_departments = pd.read_csv("company data/departments.csv")
df_employee_projects = pd.read_csv("company data/employee_projects.csv")
df_employees_realistic = pd.read_csv("company data/employees_realistic.csv")
df_order_items = pd.read_csv("company data/order_items.csv")
df_orders = pd.read_csv("company data/orders.csv")
df_projects = pd.read_csv("company data/projects.csv")

In [20]:
#creating database
conn = sqlite3.connect("company_database.db")
#create table from each dataframe
df_customers.to_sql('customers', conn, if_exists = 'replace', index = False)
df_departments.to_sql('departments', conn, if_exists = 'replace', index = False)
df_employee_projects.to_sql('employee_projects', conn, if_exists = 'replace', index = False)
df_employees_realistic.to_sql('employees_realistic', conn, if_exists = 'replace', index = False)
df_order_items.to_sql('order_items', conn, if_exists = 'replace', index = False)
df_orders.to_sql('orders', conn, if_exists = 'replace', index = False)
df_projects.to_sql('projects', conn, if_exists = 'replace', index = False)

20

In [23]:
#b) Query project id, employee id and hours worked from employee_projects and employee id's and salaries from 
#employees_realistic. Join them on employee id.

query = '''
SELECT ep.employee_id, hours_worked, er.salary
FROM
employee_projects as ep
JOIN
employees_realistic AS er
ON ep.employee_id = er.employee_id

'''
query_results = pd.read_sql(query, conn)
query_results.head()

   employee_id  hours_worked     salary
0           25         174.7   63059.43
1           92          44.5   62315.72
2           90          59.4  139659.29
3           50          72.2   55178.73
4           64          96.4   62059.38

In [48]:
#c) Calculate the salary costs per project, assuming that the employers salary is annual and number of working hours is 1900 per year. 


#d) Join this with the budget in projects table

#e) Calculate how large fraction of the project budget the salary costs are.


query = '''
SELECT 
p.project_id, 
p.budget, 
round(sum(ep.hours_worked * er.salary / 1900),2) as project_salary_cost,
round(sum(ep.hours_worked * er.salary / 1900) / p.budget * 100,2) as percentage

FROM
projects as p
JOIN
employee_projects as ep
ON p.project_id = ep.project_id
JOIN
employees_realistic as er
ON ep.employee_id = er.employee_id


GROUP BY p.project_id

'''
query_results = pd.read_sql(query, conn)
query_results.head()

   project_id    budget  project_salary_cost  percentage
0           1  25597.90             18602.58       72.67
1           2  73139.01              3058.33        4.18
2           3  46416.00             14113.67       30.41
3           5  87841.22             27521.61       31.33
4           6  77580.34              4734.74        6.10